---
title: InfillFailures
classe: Autodesk.Revit.DB.BuiltInFailures+InfillFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# InfillFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotDeleteInfill { get; }` | `InfillFailures.CannotDeleteInfill` | FailureDefinitionId |
| `FailureDefinitionId FamilyInstanceIsNotCuttingHost { get; }` | `InfillFailures.FamilyInstanceIsNotCuttingHost` | FailureDefinitionId |
| `FailureDefinitionId InfillCannotChangeType { get; }` | `InfillFailures.InfillCannotChangeType` | FailureDefinitionId |
| `FailureDefinitionId InfillCannotHaveDiffThickness { get; }` | `InfillFailures.InfillCannotHaveDiffThickness` | FailureDefinitionId |
| `FailureDefinitionId InfillDifferentPhase { get; }` | `InfillFailures.InfillDifferentPhase` | FailureDefinitionId |
| `FailureDefinitionId InfillLost { get; }` | `InfillFailures.InfillLost` | FailureDefinitionId |
| `FailureDefinitionId InfillNoSlopeGlazing { get; }` | `InfillFailures.InfillNoSlopeGlazing` | FailureDefinitionId |
| `FailureDefinitionId InfillNoThicknessCeiling { get; }` | `InfillFailures.InfillNoThicknessCeiling` | FailureDefinitionId |
| `FailureDefinitionId InfillNoThicknessMultiface { get; }` | `InfillFailures.InfillNoThicknessMultiface` | FailureDefinitionId |
| `FailureDefinitionId InPlaceFamilyNotCuttingHost { get; }` | `InfillFailures.InPlaceFamilyNotCuttingHost` | FailureDefinitionId |
| `FailureDefinitionId InsertJoinedWall { get; }` | `InfillFailures.InsertJoinedWall` | FailureDefinitionId |
| `FailureDefinitionId InsertOverlapsOrOut { get; }` | `InfillFailures.InsertOverlapsOrOut` | FailureDefinitionId |
| `FailureDefinitionId MovedInfillToHost { get; }` | `InfillFailures.MovedInfillToHost` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```